Revit 2026 API

# ColorFillSchemeUpdateEntry Method

---

Updates the scheme entry with the same parameter value as the input entry.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void UpdateEntry(
	ColorFillSchemeEntry entry
)
```
```vb
Public Sub UpdateEntry (
	entry As ColorFillSchemeEntry
)
```
```cpp
public:
void UpdateEntry(
	ColorFillSchemeEntry^ entry
)
```
```fsharp
member UpdateEntry :
        entry : ColorFillSchemeEntry -> unit
```

#### Parameters

entry ColorFillSchemeEntry
     The entry to be updated.

| Exception | Condition |
| --- | --- |
| ArgumentException | The entry does not exist or the same as input one. -or- The entry does not exist or all the updating fields are the same as existing one. |
| ArgumentNullException | A non-optional argument was null |

The following entry fields can be updated:

  * Color
  * FillPattenId
  * Caption
  * IsVisible

/

#### Reference

ColorFillScheme Class

Autodesk.Revit.DB Namespace